/*
+-----------------------------------------------------------------------------------------------------------------------
| Author: atzcl <atzcl0310@gmail.com>  https://github.com/atzcl
+-----------------------------------------------------------------------------------------------------------------------
| 验证错误信息语言文件 - zh-CN
|
*/

export default {
  required: '%s 必填',

  types: {
    email: '%s 并不是正确格式的 %s',
  },

  string: {
    len: '%s 长度为 %s 位',
    min: '%s 长度最少要 %s 位',
    max: '%s 长度最大要 %s 位',
    range: '%s 长度为 %s ~ %s 位',
  },
};
